Revit 2027 API
BoundaryConditions.Point Property
 The position of point boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Point { get; set; }
Public Property Point As XYZ
	Get
	Set
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Point : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidObjectException |  Boundary conditions is not a BoundaryConditionsType::Point type.
InvalidOperationException |  When setting this property: This BoundaryConditions is not a hosted object. -or- When setting this property: This BoundaryConditions is constrained on host.
Remarks
 Boundary conditions should be BoundaryConditionsType::Point type. Otherwise exception is thrown.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace